{
    "pending" : [
        {
            "title" : "Anonymous Merchant Integration",
            "text" : "We will integrate the merchant gateway with our anonymous network to allow for the anonymous purchasing of products."
        },
        {
            "title" : "Merchant Gateway",
            "text" : "We will implement both point of sale tools for merhcants to allow users to purchase real products with their NAV coins online and in store."
        },   
<<<<<<< HEAD
        {
            "title" : "NAV Anonymous Challenge",
            "text" : "We will reinstate the bounty which was offered to anyone who can crack the anonymous network. The previous bount was unclaimed and this fact backs up our confidence that our system is unbreakable"
        },
=======
>>>>>>> dev
        {
            "title" : "Official Promotional Video",
            "text" : "We will make a short video, which will summarise all features of Navajo Coin and explain it's Anonymous Technology to viewers in easy way. This will attract more average users and investors to Navajo Coin."
        }     
    ],
    
    "inProgress" : [
        {
            "title" : "Hierarchical Deterministic Wallet Implementaion",
            "text" : "Based on Bitcoin's BIP32 implementation, this will allow users to send & receive their NAV coins without needing to store the entire blockchain, simply using their mobile devices or a web wallet.",
            "progress" : 65
        },
        {
            "title" : "Decentralization Implementation",
            "text" : "We are now developing the release candidate for the anonymous decentralization. We are removing the reliance on an API to select an incoming server for processing anonymous transactions. Instead, the server list will be written into the wallet itself and distributed through the existing peer to peer mesh network which distributes the blockchain. Each server will become self registering so they can be brought online and begin processing transactions without human intervention.",
<<<<<<< HEAD
            "progress" : 45
=======
            "progress" : 60
>>>>>>> dev
        },
        {
            "title" : "Rasperry Pi Staking Unit",
            "text" : "We are in the process of designing and developing a Raspberry Pi controlled Staking Unit for NAV. The final implementation will be a Raspberry Pi with an interactive touch screen which allows you to setup the wallet address, view the balance and withdraw the coins all from the touch screen. All you will need to do is plug it into the network, send it some coins to stake and it will begin earning you coins. This will allow coins to be earned with very minimal setup and running costs.",
<<<<<<< HEAD
            "progress" : 40
=======
            "progress" : 50
>>>>>>> dev
        }
    ],
    
    "complete" : [
        {
<<<<<<< HEAD
=======
            "title" : "NAV Anonymous Challenge",
            "text" : "We will reinstate the bounty which was offered to anyone who can crack the anonymous network. The previous bount was unclaimed and this fact backs up our confidence that our system is unbreakable"
        },
        {
>>>>>>> dev
            "title" : "Decentralization Research & Development",
            "text" : "The Research & Development phase of the anonymous decentralization has been completed. The white paper has now been released to the public, press releases sent and NIP1 has been initialized in github."
        },
        {
            "title" : "Rasperry Pi Staking Unit Beta",
            "text" : "The Beta version of the Raspberry Pi image used on the staking devices is ready to be distributed for testing."
        },
        {
            "title" : "Press Releases and new Marketing Material",
            "text" : "We are working on improving our marketing strategy: Press releases, new & simple white paper as well as infographic are being prepared."
        },
        {
            "title" : "Navajo Coin Redesign",
            "text" : "We have decided that Navajo Coin needs new, fresh and more professional look including NAV logo, announcement's OP and wallet design."
        },
        {
            "title" : "Official Forum",
            "text" : "We will launch a dedicated forum for Navajo Coin. Every cryptocurrency needs a place where their developers and supporters can meet, without fudders or trolls."
        },
        {
            "title" : "Official Navajo Coin Multipool",
            "text" : "Multipool will allow all miners to get paid in NAV by mining the current most profitable POW coins. In result there will be more buy support on exchanges."
        },
        {
            "title" : "Anonymous Transaction Refinement",
            "text" : "We have deployed our upgrades to the Navajo Anonymous Network. Including restructuring of the sending algorithm to be more efficient. Some of these algorithm improvements are also steps towards making the anon nodes re-distributable. Adding extra error catching, around what happens if the node is unable to decipher the encrypted destination. The node will now return the coins to the sender if it is unable to decrypt and verify the destination address at the entry node. Rather than rounding the final transaction amounts to factors of 10, it now will send the amounts to the final destination in a randomly selected amount of transactions, each with randomly allocated amounts to help obscure the transactions further."
        },
        {
            "title" : "Anonymous Transactions Public Release",
            "text" : "With the main block chain successfully hard forked, the network stabilised and the major exchanges successfully running on the new wallet we are able to move forward into the final stage of deployment. The double encrypted Navajo Anonymous network will be fully functional and open to the public from Monday 23rd of March 2015."
        },
        {
            "title" : "Anonymous Transactions Hard Fork",
            "text" : "We are very pleased to announce the start of the release phase for our Anonymous Technology to the Main NAV Block Chain! Since the success of the unencrypted beta test of the transaction infrastructure, the Dev team has been busily working, adding the asymmetric double encryption to the anonymous system as well as SSL across all of the network nodes. We will be ready to hardfork the main block chain on the 9th of March 2015!"
        },
        {
            "title" : "Anonymous Transactions Beta Test",
            "text" : "The public beta test of our Navajo Anonymous Transactions system will begin on the 1st of February 2015. It will run for two weeks at which point it will close and we will begin processing the beta results. During the testing phase there will be a bounty set for anyone who can successfully trace the transactions from origin to destination. The beta test will be unencrypted to help us with analysis and testing."
        },
        {
            "title" : "Anonymous Technology - Testing Phase",
            "text" : "Our Anonymous Technology is now in Testing Phase! We are working on releasing the system in the Beta Network on January 2015."
        },
        {
            "title" : "Market Ticker & Staking Calculator",
            "text" : "We have added two new features to the wallet. First is the market ticker which lets you know in real time the price of NAV/BTC. Second one is the Staking Calculator which can show you how much free NAV you have earned from staking over the last day, week and month."
        },
        {
            "title" : "Improved Chat Feature",
            "text" : "New version of the Chat feature with improved and new features."
        },
        {
            "title" : "Navajo Faucet",
            "text" : "We will be adding a Navajo faucet to the website. You will be able to register your wallet address with the faucet and be in the lottery to get sent free NAVs."
        },
        {
            "title" : "Beta Wallet Messaging System",
            "text" : "In October we will be releasing the 3rd iteration of the beta wallet. This stage focuses on amends to the chat client's functionality. As this is being tested by the community we will continue to apply feedback from the previous rounds and work towards the next stage of the beta client."
        },
        {
            "title" : "Block Explorer & Rich List",
            "text" : "We will be adding a Block Explorer and a Rich List to the Navajo Coin website. The block explorer allows people to look up wallet addresses and see its public balance and transactions."
        },
        {
            "title" : "Beta Wallet User Interface Update",
            "text" : "With the first round of feedback collated from the Beta test, we will begin to release updates to the beta wallet in stages. The first stage focuses on amends to the user interface. Round two of the testing and feedback will commence while work continues on the next stage of the beta release."
        },
        {
            "title" : "Messaging feature built into the wallet",
            "text" : "Our first project is a decentralized messaging system that runs on the main network. At this early stage and implementation, It will allow users to share information by chatting right from the client and discuss & share information. We consider the messaging system to be another backbone of other subchain features we plan on releasing."
        }        
    ]
}
